wxffxx/ExoAnchor/device/ESP32P4/firmware/v0.86.6-dev/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# Keep the USB host's short-lived transfer ring in low-latency internal DMA
# memory, as in Espressif's UVC example. Full MJPEG frames remain in PSRAM.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=150000
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_ETH_ENABLED=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_LIBSSH2_DEBUG_ENABLE=n
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_LWIP_MAX_SOCKETS=48
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_SI_ETH_ENABLE=y
CONFIG_SI_ETH_WAIT_IP_TIMEOUT_MS=15000
CONFIG_LWIP_AUTOIP=y
CONFIG_LWIP_AUTOIP_TRIES=5
CONFIG_SI_AUTH_PASSWORD=""
CONFIG_SI_POWER_ENABLE=y
CONFIG_SI_POWER_PRESS_MS=500
CONFIG_SI_POWER_FORCE_OFF_MS=5000
CONFIG_SI_HID_USB_ENABLE=y
CONFIG_SI_VIDEO_ENABLE=y
CONFIG_SI_VIDEO_WIDTH=1920
CONFIG_SI_VIDEO_HEIGHT=1080
CONFIG_SI_VIDEO_UVC_FPS=25
CONFIG_SI_VIDEO_UVC_FRAME_BUFFERS=3
# MS2109 occasionally clears the optional EOH flag while keeping a structurally
# valid 2..12 byte UVC payload header. Keep all length/PTS/SCR validation, but
# do not reject an otherwise valid packet solely for that compatibility bit.
# CONFIG_UVC_CHECK_PAYLOAD_HEADER_EOH is not set
# The DWC controller can DMA to PSRAM, but its cache synchronization and PSRAM
# latency are unnecessary for the small UVC transfer ring and reduce scheduling
# margin under 1080p MJPEG load. Use the official four-by-10-KiB arrangement in
# protected internal DMA memory; only complete frame buffers live in PSRAM.
# CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM is not set
CONFIG_SI_VIDEO_UVC_URBS=4
CONFIG_SI_VIDEO_UVC_URB_SIZE=10240
CONFIG_SI_VIDEO_UVC_JPEG_BUFFER_SIZE=2097152
CONFIG_SI_VIDEO_JPEG_QUALITY=75
CONFIG_SI_VIDEO_STREAM_DELAY_MS=33
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=500
CONFIG_USB_HOST_RESET_HOLD_MS=100
CONFIG_USB_HOST_RESET_RECOVERY_MS=100
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=100
CONFIG_USB_HOST_EXT_PORT_RESET_RECOVERY_DELAY_MS=100
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
CONFIG_USB_HOST_HUBS_SUPPORTED=y
CONFIG_TINYUSB_HID_COUNT=3
CONFIG_TINYUSB_MIDI_COUNT=0
CONFIG_TINYUSB_DFU_MODE_NONE=y
CONFIG_TINYUSB_NET_MODE_NONE=y
CONFIG_TINYUSB_VENDOR_COUNT=0
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
